{
  "translation": {
    "about": "about",
    "blogs": "blogs",
    "music": "music",
    "more": "more",
    "intro_1": "I'm Alexander ZHÀO",
    "intro_2": "Web3 developer (Typescript/Rust)",
    "intro_3": "Alto saxophinst",
    "coming_soon": "coming soon",
    "min_read_one": "minute read",
    "min_read_other": "minutes read",
    "pay_wechat": "Wechat pay",
    "eth": "ETH",
    "tech": "tech",
    "journal": "journal",
    "buy_me_coffee": "Buy me a coffee ☕️",

    "20200809.title": "Implement ripple effect by directives on Vue components",
    "20200809.sec1.title": "Final Effect",
    "20200809.sec2.title": "What is directives?",
    "20200809.sec2.p1": "<a href=\"https://vuejs.org/guide/reusability/custom-directives.html\" target=\"_blank\" rel=\"nofollow\">Vue docs</a> defines directives as \"some low-level DOM access on plain elements\".",
    "20200809.sec2.p2": "In short, due to the data-driven of MVVM, it is not recommended to manipulate DOM. However, occasionally, it cannot be avoided to manipulate DOM with the same logic in different conditions. Now, using directives will abstract the logic and improve the reusability.",
    "20200809.sec3.title": "How to implement ripple effect?",
    "20200809.sec3.subtitle1": "1. Locate the click/touch",
    "20200809.sec3.subtitle2": "2. Create the ripple layer by absolute position",
    "20200809.sec3.subtitle3": "3. Create diffusion effect by CSS",
    "20200809.sec4.title": "Demo",
    "20200809.sec5.title": "Thinking: Cons of not using directives",
    "20200809.sec5.p1": "Two kinds of components - ripple and non-ripple components, will be needed, which increases the redundancy and is not agile enough.",
    "20200809.sec5.p2": "The logic execution in the life cycle is not as clear as using directives hooks.",

    "20210127.title": "Goodbye, Mamba",
    "20210127.sec1.title": "Chap 0",
    "20210127.sec1.p1": "On this day last year, all basked in the happiness of Chinese new year. However, my mom, who never cared about my oversleeping, woke me up even before dawn.",
    "20210127.sec1.p2": "\"Kobe died.\" She told me directly, but without any offense against Kobe.",
    "20210127.sec1.p3": "\"Impossible! Keep away from fake news!\" I lost my patience and drove her away.",
    "20210127.sec1.p4": "She went to prepare the breakfast after my scold.",
    "20210127.sec1.p5": "When opened the news app in doubt, breaking one - \"Kobe Bryant, daughter among 9 killed in California helicopter crash.\" made me shocked.",
    "20210127.sec1.p6": "It came to my mind that Kobe's double pump layup againt 5 Spurs, bank shot buzzer beater against Wade, free throw line dunk on Wallace, 360 cross over assist to Turiaf and alleyoop to Shaq over Pippen etc. But in a suddon, I couldn't see anything anymore.",
    "20210127.sec1.p7": "I tried to refresh the page time and time again, to wish this was fake news. Nevertheless more and more live news and photos arrived.",
    "20210127.sec1.p8": "Although it was the Spring Festival, I wasn't excited at all.",
    "20210127.sec1.p9": "The idol means no less than brothers, sometimes.",
    "20210127.sec2.title": "Chap 1",
    "20210127.sec2.p1": "When I was young, I preferred Yao Ming and LBJ to Kobe. The reason for Yao is obvious. I loved LBJ because he was the selected one and the king. I hated Kobe because of his selfishness -- he would rather take the tough shot than pass to the open teammates.",
    "20210127.sec2.p2": "So when did I start to love Kobe? I don't know. But it must be after I had my own career.",
    "20210127.sec2.p3": "When I faced kinds of difficulties of my job, I started to know he was selfish not because he wanted to show or to dominate; but because he insisted to take the charge as the ourstanding star of the team.",
    "20210127.sec2.p4": "I knew lots of mediocre people. They had one common feature -- when problems occurred, they complained or asked for help without any own thought. I guess a mediocre basketball player wouldn't be punished if he chose to pass the ball when they trailed or gave up the match.",
    "20210127.sec2.p5": "Kobe rejected to do so. He trusted teammates but he didn't depend on teammates on such moment.",
    "20210127.sec2.p6": "He's the one who's not afraid of lost, who would never give up, and who takes the responsibilities when even to fail.",
    "20210127.sec2.p7": "Responsibilities.",
    "20210127.sec2.p8": "Yes, indeed I started to love Kobe after I took my career. I don't need to take the responsibilities before finding a job. ask for parents if no money; broke up with the girlfriend if not satisfied; copy the homework if not finished.",
    "20210127.sec2.p9": "But now, who would like to help your work?",
    "20210127.sec2.p10": "Life was just like a box of responsibilities. Kobe is one of the best pattern of taking responsibilities.",
    "20210127.sec3.title": "Chap 2",
    "20210127.sec3.p1": "Kobe wasn't top talent in NBA. He went behind the GOAT MJ by strength, shoulder width, and especially the hand size.",
    "20210127.sec3.p2": "But he made it. He became the one closest to the god of basketball.",
    "20210127.sec3.p3": "I believe the only reason is Kobe's answer to one interview long ago:",
    "20210127.sec3.p4": "\"Have you seen Los Angeles at 4am?\"",
    "20210127.sec3.p5": "Many basketball players had ever seen LA at 4am, even NYC and Boston. They were familiar with the environment of the night clubs at 4am.",
    "20210127.sec3.p6": "I always keep the opinion that the talent determines the ceiling, while the hardworking, the floor.",
    "20210127.sec3.p7": "One interesting thing is that I had a friend by playing basketball. He was too plain to perform fade away jumper or have shots like Curry. But his offensive and defensive clutch must be beyond the average. I was told he had watched the basketball video and had practised for the whole summer holidays.",
    "20210127.sec3.p8": "Without almost crazy training, Kobe could be another role player named Bryant.",
    "20210127.sec3.p9": "Hardworking.",
    "20210127.sec3.p10": "In current involuted society, move forward, or you'll fall behind. Kobe is one of the best pattern of hardworking.",
    "20210127.sec4.title": "Chap 3",
    "20210127.sec4.p1": "I have read lots of blogs about saying goodbye to Kobe and black mamba during the deathday of him.",
    "20210127.sec4.p2": "I just wonder who or what we're saying goodbye to.",
    "20210127.sec4.p3": "Absolutely it is Kobe, but it seems not only to be Kobe.",
    "20210127.sec4.p4": "The early Kobe fans are going to work, to marry and to bear the children. The basketball is flat and the jersey is folded. Sometimes when passing by the basketball court, I will envy the students in uniform and cheap sneakers, without any gears.",
    "20210127.sec4.p5": "Well, finally I got the answer.",
    "20210127.sec4.p6": "We're saying goodbye to ourselves as well, who used to be irresponsible and undisciplined.",
    "20210127.sec4.p7": "However, we embraced the spiritual wealth Kobe left - the mamba mentality.",
    "20210127.sec4.p8": "Goodbye, Kobe. Goodbye, Mamba.",
    "20210127.sec4.caption": "(Kobe 9 elite high, HKBU Gym, 2016)",

    "20210331.title": "Draw Xiaomi new logo by pure CSS",
    "20210331.sec1.title": "Synopsis",
    "20210331.sec1.p1": "Xiaomi released their new logo today and it is said that this was charged RMB 2M.",
    "20210331.sec1.p2": "Mr Leibs always does good at marketing.",
    "20210331.sec1.p3": "There are also rumors that one-line code is not worth 2M.",
    "20210331.sec1.p4": "I would rather say Leibs is doing marketing more than coding -- Xiaomi is now on the top search just by changing a logo. When it comes to the upcoming release of Xiaomi cars, you have to admit Leibs did a great job at the very moment.",
    "20210331.sec2.title": "Really that simple?",
    "20210331.sec2.p1": "Outsiders see the out side, insiders see the in side.",
    "20210331.sec2.p2": "You may not be familiar with the designer Kenya Hara(はら けんや).",
    "20210331.sec2.p3": "But you must have heard about his design. Yes, he is the CAO of MUJI.",
    "20210331.sec2.p4": "I was pushed to take another look at the two-million-RMB logo. Indeed, I found some clues.",
    "20210331.sec2.p5": "First of all, the logo is not just corner-rounded by one line code, as the comparison below.",
    "20210331.sec2.p6": "Even weak-eyed people could tell the difference. Simply speaking, the left one is corner-rounded, while the right one is apparently not.",
    "20210331.sec2.p7": "Double checked the design idea. The logo follows the Lamé curve in Cartesian coordinate system, which is named superellipse also as below.",
    "20210331.sec2.p8": "So here is the question. How to implement superellipse by CSS?",
    "20210331.sec3.title": "Implement superellipse by CSS",
    "20210331.sec3.p1": "Let's compare superellipse with rounded corner.",
    "20210331.sec3.p2": "The biggest difference is the bulge part in red. If you have experience in PS and pencil tool, you will know this could be done by adjusting the length of axis of tangent line. It is okay if you know nothing about PS. In other word, the rounded corner is not the part of perfect circle, but ellipse instead.",
    "20210331.sec3.p3": "",
    "20210331.sec3.p4": "",
    "20210331.sec3.p5": "That is, the value before / is the length of h axis, the value after / is the length of v axis.",
    "20210331.sec3.p6": "Try to implement this kind of rounded corner.",
    "20210331.sec3.p7": "It seems to be so. But obviously only the top and bottom sides of the rectangle are bulged because this method can only define the h/v of one pair of rectangle sides to be bulged. To do so in the other pair of rectangle sides, the easiest way is using pseudo elements.",
    "20210331.sec3.p8": "There will also be a problem by doing this. That is, the bulged part is covered by the other pseudo element. Let's adjust the height and width of pseudo elements.",
    "20210331.sec3.p9": "",
    "20210331.sec3.p10": "Almost the same, except for the MI logo text.",
    "20210331.sec4.title": "Almost the same?",
    "20210331.sec4.p1": "I do believe some PMs hold the idea that \"production must perfectly fit the design prototype\". I have to admit that the production above is almost the same, but not perfectly. ",
    "20210331.sec4.p2": "",
    "20210331.sec4.p3": "Thus, is there a way to draw a rectangle corners as function graph?",
    "20210331.sec4.p4": "",
    "20210331.sec4.p5": "In the initial version I just tried linking all the points by straight lines. The shape is not filled and heavily sawtoothed.",
    "20210331.sec4.p6": "Well, smoother. Let's hire Bézier curve and get it done.",
    "20210331.sec5.title": "Think more",
    "20210331.sec5.p1": "",
    "20210331.sec5.p2": "Well, you are genius.",
    "20210331.sec5.p3": "",
    "20210331.sec5.p4": "After some research, I found CSS Houdini, which is born in 2016, could handle this problem.",
    "20210331.sec5.p5": "CSS Houdini gives developers the power to extend CSS by a set of low-level APIs that exposes parts of the CSS engine. This Houdini name can be found in lots of areas, most of which are related to visual effects, in memory of Harry Houdini, the greatest illusionist.",
    "20210331.sec5.p6": "",
    "20210331.sec5.p7": "",
    "20210331.sec5.p8": "",
    "20210331.sec5.p9": "",
    "20210331.sec5.p10": "Well done. Try another troll, soft.",
    "20210331.sec6.title": "Generalizing",
    "20210331.sec6.p1": "The troll is playing with the keyboard and say: your code will not work if the DOM is not 256px because you made the height and width fixed.",
    "20210331.sec6.p2": "Interesting. I'll make you regret.",
    "20210331.sec6.p3": "",
    "20210331.sec6.p4": "",
    "20210331.sec6.p5": "The second parameter tells us the width and the height of the canvas that is at our disposal.",
    "20210331.sec6.p6": "The third paramter is the CSS properties the paint worklet can access.",
    "20210331.sec6.p7": "",
    "20210331.sec6.p8": "Obviously, we can use the second parameter to get the DOM height and width.",
    "20210331.sec6.p9": "The mobile browser support for CSS Houdini is not that good at the moment, and it may not work on mobile devices.",
    "20210331.sec6.p10": "At the end of last, let's draw Xiaomi new logo by pure CSS.",
    "20210331.sec6.p11": "How about rewarding me a Mi cars, Leibs?"
  }
}
